sim-test/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom patch;

sourceCase "./";

sourcePatches
  (
    frontEmpty
  );

exposedPatchName backEmpty;

flipNormals false;
extrudeModel linearNormal;

nLayers 1;

expansionRatio 1;

linearNormalCoeffs
{
  thickness 1;
}

mergeFaces false;
mergeTol 0;