sim-test/system/sampleGrid
functions
{

data
{
    type                sets;
    writeControl        writeTime;
    //outputInterval      1;
    interpolationScheme cellPoint;
    fields          (U);

    setFormat csv;

    sets
    (
        data
        {
            type cloud;
            axis xyz;
            points
            (
( 1.1 -2.5 0.0 )
( 1.1 -2.25 0.0 )
( 1.1 -2.0 0.0 )
( 1.1 -1.75 0.0 )
( 1.1 -1.5 0.0 )
( 1.1 -1.25 0.0 )
( 1.1 -1.0 0.0 )
( 1.1 -0.75 0.0 )
( 1.1 -0.5 0.0 )
( 1.1 -0.25 0.0 )
( 1.1 0.0 0.0 )
( 1.1 0.25 0.0 )
( 1.1 0.5 0.0 )
( 1.1 0.75 0.0 )
( 1.1 1.0 0.0 )
( 1.1 1.25 0.0 )
( 1.1 1.5 0.0 )
( 1.1 1.75 0.0 )
( 1.1 2.0 0.0 )
( 1.1 2.25 0.0 )
( 1.1 2.5 0.0 )
( 1.2950000000000002 -2.5 0.0 )
( 1.2950000000000002 -2.25 0.0 )
( 1.2950000000000002 -2.0 0.0 )
( 1.2950000000000002 -1.75 0.0 )
( 1.2950000000000002 -1.5 0.0 )
( 1.2950000000000002 -1.25 0.0 )
( 1.2950000000000002 -1.0 0.0 )
( 1.2950000000000002 -0.75 0.0 )
( 1.2950000000000002 -0.5 0.0 )
( 1.2950000000000002 -0.25 0.0 )
( 1.2950000000000002 0.0 0.0 )
( 1.2950000000000002 0.25 0.0 )
( 1.2950000000000002 0.5 0.0 )
( 1.2950000000000002 0.75 0.0 )
( 1.2950000000000002 1.0 0.0 )
( 1.2950000000000002 1.25 0.0 )
( 1.2950000000000002 1.5 0.0 )
( 1.2950000000000002 1.75 0.0 )
( 1.2950000000000002 2.0 0.0 )
( 1.2950000000000002 2.25 0.0 )
( 1.2950000000000002 2.5 0.0 )
( 1.4900000000000002 -2.5 0.0 )
( 1.4900000000000002 -2.25 0.0 )
( 1.4900000000000002 -2.0 0.0 )
( 1.4900000000000002 -1.75 0.0 )
( 1.4900000000000002 -1.5 0.0 )
( 1.4900000000000002 -1.25 0.0 )
( 1.4900000000000002 -1.0 0.0 )
( 1.4900000000000002 -0.75 0.0 )
( 1.4900000000000002 -0.5 0.0 )
( 1.4900000000000002 -0.25 0.0 )
( 1.4900000000000002 0.0 0.0 )
( 1.4900000000000002 0.25 0.0 )
( 1.4900000000000002 0.5 0.0 )
( 1.4900000000000002 0.75 0.0 )
( 1.4900000000000002 1.0 0.0 )
( 1.4900000000000002 1.25 0.0 )
( 1.4900000000000002 1.5 0.0 )
( 1.4900000000000002 1.75 0.0 )
( 1.4900000000000002 2.0 0.0 )
( 1.4900000000000002 2.25 0.0 )
( 1.4900000000000002 2.5 0.0 )
( 1.685 -2.5 0.0 )
( 1.685 -2.25 0.0 )
( 1.685 -2.0 0.0 )
( 1.685 -1.75 0.0 )
( 1.685 -1.5 0.0 )
( 1.685 -1.25 0.0 )
( 1.685 -1.0 0.0 )
( 1.685 -0.75 0.0 )
( 1.685 -0.5 0.0 )
( 1.685 -0.25 0.0 )
( 1.685 0.0 0.0 )
( 1.685 0.25 0.0 )
( 1.685 0.5 0.0 )
( 1.685 0.75 0.0 )
( 1.685 1.0 0.0 )
( 1.685 1.25 0.0 )
( 1.685 1.5 0.0 )
( 1.685 1.75 0.0 )
( 1.685 2.0 0.0 )
( 1.685 2.25 0.0 )
( 1.685 2.5 0.0 )
( 1.8800000000000001 -2.5 0.0 )
( 1.8800000000000001 -2.25 0.0 )
( 1.8800000000000001 -2.0 0.0 )
( 1.8800000000000001 -1.75 0.0 )
( 1.8800000000000001 -1.5 0.0 )
( 1.8800000000000001 -1.25 0.0 )
( 1.8800000000000001 -1.0 0.0 )
( 1.8800000000000001 -0.75 0.0 )
( 1.8800000000000001 -0.5 0.0 )
( 1.8800000000000001 -0.25 0.0 )
( 1.8800000000000001 0.0 0.0 )
( 1.8800000000000001 0.25 0.0 )
( 1.8800000000000001 0.5 0.0 )
( 1.8800000000000001 0.75 0.0 )
( 1.8800000000000001 1.0 0.0 )
...
            );
        }   
    );
}
}